In [1]:
select * from employees1
select * from departments
sp_help employees1
sp_help departments
--Q1
select FIRST_NAME ,LAST_NAME,salary,DEPARTMENT_ID,JOB_ID from employees1 where JOB_ID='SA_REP'
--Q2
select FIRST_NAME ,LAST_NAME,salary,DEPARTMENT_ID,JOB_ID from employees1 where MANAGER_ID=122
--Q3
select FIRST_NAME ,LAST_NAME,HIRE_DATE from employees1 where HIRE_DATE between '08/01/1987' and '08/19/1987'
--Q4
select  EMPLOYEE_ID,FIRST_NAME,LAST_NAME,JOB_ID FROM employees1 where EMPLOYEE_ID between 103 and 120
--Q5
select FIRST_NAME,LAST_NAME,DEPARTMENT_ID from employees1 where DEPARTMENT_ID in (90,60,100,30)
--Q6
select DEPARTMENT_ID, sum(salary) from employees1 where DEPARTMENT_ID in (select DEPARTMENT_ID from departments) group by DEPARTMENT_ID
--Q7
select FIRST_NAME,LAST_NAME from employees1 where MANAGER_ID in (100,101)
--Q8
select FIRST_NAME, LAST_NAME from employees1 where DEPARTMENT_ID in(select DEPARTMENT_ID from employees1 group by DEPARTMENT_ID
having count(DEPARTMENT_ID) between 1 and 2) and MANAGER_ID not in(201,205)

--Q9
select * from employees1
select * from departments
select * from job_history

select  * from departments
where DEPARTMENT_ID in(select DEPARTMENT_ID from employees1
where EMPLOYEE_ID in(select EMPLOYEE_ID from job_history group by EMPLOYEE_ID having count(EMPLOYEE_ID)>1)
group by DEPARTMENT_ID having max(SALARY) > 7000)

--Q10
select * from locations
select * from departments where DEPARTMENT_ID in (70,90,110)
--Q11
select DEPARTMENT_ID, concat(FIRST_NAME, '', LAST_NAME)as FullName, SALARY from employees1 a 
WHERE SALARY in(SELECT max(SALARY) from employees1 where DEPARTMENT_ID=a.DEPARTMENT_ID)

--Q12
select * from jobs
select job_id,JOB_TITLE,MIN_SALARY,MAX_SALARY from jobs where JOB_ID='SA_REP'

: Msg 102, Level 15, State 1, Line 3
Incorrect syntax near 'employees1'.